Repository: analaura09/free-python-games
Catalog: docs/locale/*/LC_MESSAGES/api.po
Languages: pt_br

source: Free Python Games API Reference
pt_br: Referência da API do Free Python Games

source: :doc:`Free Python Games <index>` includes a few helpful utilities. The best way to expose beginners to these functions is with Python's built-in help function. Learners should be able to understand and write the drawing functions themselves.
pt_br: :doc:`Free Python Games <index>` inclui alguns utilitários úteis. A melhor maneira de expor os iniciantes a essas funções é com a função de ajuda integrada do Python. Os alunos devem ser capazes de compreender e escrever as funções de desenho por si mesmos.

source: Drawing Functions
pt_br: Funções de Desenho

source: Draw line from `(a, b)` to `(x, y)`.
pt_br: Desenhe uma linha de (a, b) a (x, y).

source: Draw square at `(x, y)` with side length `size` and fill color `name`.
pt_br: Desenhe um quadrado em (x, y) com o `tamanho` do comprimento lateral e preencha o `nome` da cor.

source: The square is oriented so the bottom left corner is at (x, y).
pt_br: O quadrado é orientado de forma que o canto esquerdo inferior esteja em (x, y).

source: Helper Functions
pt_br: Funções de ajuda

source: Floor of `value` given `size` and `offset`.
pt_br: Piso de `valor` dado `tamanho` e `deslocamento`.

source: The floor function is best understood with a diagram of the number line::
pt_br: A função do piso é melhor compreendida com um diagrama da reta numérica:

source: The number line shown has offset 200 denoted by the left-hand tick mark at -200 and size 100 denoted by the tick marks at -100, 0, 100, and 200. The floor of a value is the left-hand tick mark of the range where it lies. So for the points show above: ``floor(x)`` is -200, ``floor(y)`` is 0, and ``floor(z)`` is 100.
pt_br: A linha de número mostrada tem deslocamento 200 denotado pela marca de escala à esquerda em -200 e o tamanho 100 indicado pelas marcas de escala em -100, 0, 100 e 200. O piso de um valor é a marca de escala à esquerda do intervalo onde se encontra. Portanto, para os pontos mostrados acima: o ``piso(x)`` é -200, o ``piso(y)`` é 0 e o ``piso(z)`` é 100.

source: Return full path to `filename` in freegames module.
pt_br: Retorna o caminho completo para o `nome do arquivo` no módulo freegames.

source: Vectors
pt_br: Vetores

source: Two-dimensional vector.
pt_br: Vetor bidimensional.

source: Vectors can be modified in-place.
pt_br: Os vetores podem ser modificados no local.

source: Initialize vector with coordinates: x, y.
pt_br: Inicialize o vetor com as coordenadas: x, y.

source: Return copy of vector.
pt_br: Retorna a cópia do vetor.

source: Move vector by other (in-place).
pt_br: Move o vetor por outro (no local).

source: Rotate vector counter-clockwise by angle (in-place).
pt_br: Gire o vetor no sentido anti-horário pelo ângulo (no local).

source: Scale vector by other (in-place).
pt_br: Escala o vetor por outro (no local).

source: X-axis component of vector.
pt_br: Componente do eixo X do vetor.

source: Y-axis component of vector.
pt_br: Componente do eixo Y do vetor.
