Repository: analaura09/free-python-games
Catalog: docs/locale/*/LC_MESSAGES/curriculum.po
Languages: pt_br

source: Free Python Games Curriculum
pt_br: Currículo Free Python Games

source: What follows are notes for a week-long curriculum developed for Maker Camp at The River Church Community. Maker Camp was a summer day camp for Middle School students in the California Bay Area.
pt_br: O que se segue são notas para um currículo de uma semana desenvolvido para o Maker Camp na Comunidade da Igreja River. Maker Camp era um acampamento de verão para estudantes do Ensino Médio na área da baía da Califórnia.

source: Each game has exercises at the top.
pt_br: Cada jogo tem exercícios no topo.

source: Visualize code with http://pythontutor.com
pt_br: Visualize o código com http://pythontutor.com

source: Day 1
pt_br: Dia 1

source: What is a computer? Calculator + Clock.
pt_br: O que é um computador? Calculadora + Relógio.

source: Discuss Alan Turing and Turing Machines.
pt_br: Discuta Alan Turing e a Máquina de Turing.

source: Discuss John Von Neumann and Von Neumann Machines.
pt_br: Discuta John Von Neumann e Máquinas Von Neumann.

source: What is a program? Computer Recipe.
pt_br: O que é um programa? Receita do Computador.

source: Introduce Terminal, black background, give the computer commands.
pt_br: Introduza o terminal, plano de fundo preto, dê comandos ao computador.

source: Introduce Python Shell, white background, write Python statements.
pt_br: Introduza o Python Shell, plano de fundo branco, escreva instruções python.

source: Activity: connect and decorate computers.
pt_br: Atividade: conectar e decorar computadores.

source: Problem solving: divide and conquer.
pt_br: Resolução de problemas: dividir e conquistar.

source: Statements: assignment, if/elif/else, while, import
pt_br: Declarações: assignment, if/elif/else, while, import

source: Data types: int, str
pt_br: Tipos de dados: int, str

source: Functions: print, help, int
pt_br: Funções: print, help, int

source: Modules: random
pt_br: Módulos: random

source: Games
pt_br: Jogos

source: :doc:`guess`.py - Guess number within range.
pt_br: :doc:`guess`.py - Adivinhar um número dentro de um intervalo.

source: Explain: from random import randint
pt_br: Explique: from random import randint

source: Variables
pt_br: Variáveis

source: Equality
pt_br: Igualdade

source: Inequality
pt_br: Desigualdade

source: Increase range to 1,000 and guess the number.
pt_br: Aumente o intervalo para 1.000 e adivinhe o número.

source: Discuss method of guessing. That's an algorithm!
pt_br: Discuta o método de adivinhação. Isso é um algoritmo!

source: :doc:`snake`.py - Classic arcade game.
pt_br: :doc:`snake`.py - Jogo clássico de arcade.

source: Bible Story
pt_br: História da Bíblia

source: Genesis 1 - God the Creator (Creation)
pt_br: Gênesis 1 - Deus, o Criador (Criação)

source: What did God do at the beginning?
pt_br: O que Deus fez no início?

source: What did God see in creation?
pt_br: O que Deus viu na criação?

source: What is special about people?
pt_br: O que há de especial nas pessoas?

source: Why do we create things?
pt_br: Por que criamos coisas?

source: Day 2
pt_br: Dia 2

source: Activity: Blind partner obstacle course.
pt_br: Atividade: Pista de obstáculos para parceiros cegos.

source: Problem solving: brute-force.
pt_br: Resolução de problemas: força bruta.

source: Famous Christian programmer: Donald Knuth
pt_br: Programador cristão famoso: Donald Knuth

source: Statements: try/except, for, def
pt_br: Declarações: try/except, for, def

source: Data types: float, bool
pt_br: Tipos de dados: float, bool

source: Functions: type, dir, str, ord, chr
pt_br: Funções: type, dir, str, ord, chr

source: Modules: turtle
pt_br: Módulos: turtle

source: :doc:`crypto`.py - Encrypt, decrypt and decode messages.
pt_br: :doc:`crypto`.py - Criptografar, descriptografar e decodificar mensagens.

source: ord function and chr function
pt_br: função ord e função chr

source: modulo operator
pt_br: módulo operador

source: Write decode function
pt_br: Função de decodificação de escrita

source: Encrypt numbers
pt_br: Criptografar números

source: :doc:`paint`.py - Draw shapes.
pt_br: :doc:`paint`.py - Desenhe formas.

source: Draw line
pt_br: Desenhar linha

source: Draw square
pt_br: Desenhar quadrado

source: for-statement, range function.
pt_br: declaração for, função de alcance.

source: Draw five-pointed star: forward(50); right(144) (x5)
pt_br: Desenhar uma estrela de cinco pontas: para a frente(50); direita(144) (x5)

source: Draw six-pointed star: forward(50); left(60); forward(50); right(120) (x6)
pt_br: Desenhar uma estrela de seis pontas: para a frente(50); esquerda(60); para a frente(50); direita(120) (x6)

source: def-statement, refactor code to star function
pt_br: declaração def, refatorar código para função estrela

source: color('green'); color('blue', 'yellow')
pt_br: cor ('verde'); cor ('azul', 'amarelo')

source: width function
pt_br: função de largura

source: Write polygon(sides, length) function
pt_br: Escrever função polígono(lados, comprimento)

source: :doc:`flappy`.py - Flappy Bird inspired game.
pt_br: :doc:`flappy`.py - Jogo inspirado em Flappy Bird.

source: Genesis 6:5-22 - God the Engineer (Noah)
pt_br: Gênesis 6:5-22 - Deus, o Engenheiro (Noé)

source: Why did God regret making people?
pt_br: Por que Deus se arrependeu de ter feito as pessoas?

source: How was Noah different?
pt_br: Qual era a diferença de Noé?

source: What was God's plan?
pt_br: Qual era o plano de Deus?

source: How are we washed today?
pt_br: Como estamos lavados hoje?

source: Day 3
pt_br: Dia 3

source: Activity: Simon Says
pt_br: Atividade: Simon Says

source: Famous Christian programmer: Fred Brooks
pt_br: Programador cristão famoso: Fred Brooks

source: Functions: onscreenclick, onkey, ontimer
pt_br: Funções: onscreenclick, onkey, ontimer

source: :doc:`bagels`.py - Digit guessing puzzle.
pt_br: :doc:`bagels`.py - Quebra-cabeça de adivinhação de dígitos.

source: Animation
pt_br: Animação

source: Draw arc: circle(100, 90)
pt_br: Desenhar um arco: círculo (100, 90)

source: flower(...)
pt_br: flor(...)

source: Draw flower and rotate
pt_br: Desenhe uma flor e gire

source: hideturtle(); tracer(False); polygon(4, 200); update()
pt_br: hideturtle(); marcador(False); polígono(4, 200); atualização()

source: :doc:`tictactoe`.py - Tic-tac-toe.
pt_br: :doc:`tictactoe`.py - Jogo da velha.

source: line(...)
pt_br: linha(...)

source: grid(...)
pt_br: grade(...)

source: drawx(...)
pt_br: desenharx(...)

source: drawo(...)
pt_br: desenharo(...)

source: floor(...)
pt_br: piso(...)

source: :doc:`cannon`.py - Hitting targets with projectiles.
pt_br: :doc:`cannon`.py - Atingir alvos com projéteis.

source: Mark 1:1-18 - God the Programmer ("fishers of people")
pt_br: Marcos 1:1-18 - Deus, o programador ("pescadores de pessoas")

source: What did Isaiah say would happen?
pt_br: O que Isaías disse que aconteceria?

source: What did John the Baptist say would happen?
pt_br: O que João Batista disse que aconteceria?

source: What did God say about Jesus? When?
pt_br: O que Deus disse sobre Jesus? Quando?

source: How did Jesus give his disciples new jobs?
pt_br: Como Jesus deu novos empregos a seus discípulos?

source: Day 4
pt_br: Dia 4

source: Activity: Collage of concepts.
pt_br: Atividade: Colagem de conceitos.

source: Famous Christian programmer: Larry Wall
pt_br: Programador cristão famoso: Larry Wall

source: Data types: list, dict, vector
pt_br: Tipos de dados: list, dict, vector

source: :doc:`bounce`.py - Simple animation demo.
pt_br: :doc:`bounce`.py - Demonstração de animação simples.

source: :doc:`pong`.py - Classic arcade game.
pt_br: :doc:`pong`.py - Jogo clássico de arcade.

source: :doc:`ant`.py - Simple animation demo.
pt_br: :doc:`ant`.py - Demonstração de animação simples.

source: :doc:`tron`.py - Classic arcade game.
pt_br: :doc:`tron`.py - Jogo clássico de arcade.

source: :doc:`tiles`.py - Puzzle game of number shuffling.
pt_br: :doc:`tiles`.py - Jogo de quebra-cabeça de embaralhamento de números.

source: John 9:1-33 - God the Debugger (Blind Man and Jesus)
pt_br: João 9:1-33 - Deus, o Depurador (Homem Cego e Jesus)

source: What does Jesus tell the disciples?
pt_br: O que Jesus disse aos discípulos?

source: What does the man tell the Pharisees?
pt_br: O que o homem disse aos fariseus?

source: What does the man believe about Jesus?
pt_br: O que o homem acredita sobre Jesus?

source: What do you believe about Jesus?
pt_br: O que você acredita sobre Jesus?

source: Day 5
pt_br: Dia 5

source: Activity: Make or modify your own game.
pt_br: Atividade: Faça ou modifique seu próprio jogo.

source: Famous Christian programmer: Jon Skeet
pt_br: Programador cristão famoso: Jon Skeet

source: Answer: What next?
pt_br: Resposta: O que vem a seguir?

source: :doc:`connect`.py - Connect Four
pt_br: :doc:`connect`.py - Conecte quatro

source: :doc:`memory`.py - Puzzle game of number pairs.
pt_br: :doc:`memory`.py - Jogo de quebra-cabeça de pares de números.

source: :doc:`pacman`.py - Classic arcade game.
pt_br: :doc:`pacman`.py - Jogo clássico de arcade.

source: Revelation 21 - God the Restorer (New Heaven and New Earth)
pt_br: Apocalipse 21 - Deus, o Restaurador (Novo Céu e Nova Terra)

source: What does God make? When?
pt_br: O que Deus faz? Quando?

source: Who is the Lamb and the Bride?
pt_br: Quem é o Cordeiro e a Noiva?

source: What is special about the city?
pt_br: O que há de especial na cidade?

source: How can we live in the Holy City?
pt_br: Como podemos viver na Cidade Santa?
