Repository: analaura09/free-python-games
Catalog: docs/locale/*/LC_MESSAGES/development.po
Languages: pt_br

source: Free Python Games Development
pt_br: Desenvolvimento de Free Python Games

source: :doc:`Free Python Games <index>` development is lead by Grant Jenks <contact@grantjenks.com>.
pt_br: :doc:O desenvolvimento de `Free Python Games <index>` é liderado por Grant Jenks <contact@grantjenks.com>.

source: Collaborators Welcome
pt_br: Colaboradores são bem-vindos

source: Search issues or open a new issue to start a discussion around a bug.
pt_br: Pesquise issues ou abra uma nova issue para iniciar uma discussão sobre um bug.

source: Fork the `GitHub repository`_ and make your changes in a new branch.
pt_br: Faça um fork do `repositório no GitHub`_ e faça suas alterações em um novo branch.

source: Write a test which shows the bug was fixed.
pt_br: Escreva um teste que mostre que o bug foi corrigido.

source: Send a pull request and message the development lead until its merged and published.
pt_br: Envie um pull request e uma mensagem ao líder de desenvolvimento até que seja mesclado e publicado.

source: Requests for Contributions
pt_br: Pedidos de contribuições

source: Simplifications to existing games.
pt_br: Simplificações de jogos existentes.

source: Refactoring to simplify games.
pt_br: Refatoração para simplificar os jogos.

source: Improved documentation.
pt_br: Melhoria da documentação.

source: Additional games. Requirements for new games:
pt_br: Jogos adicionais. Requisitos para novos jogos:

source: Fun to play.
pt_br: Divertido de jogar.

source: Matching code style.
pt_br: Estilo de código correspondente.

source: Limited Python feature set.
pt_br: Conjunto limitado de recursos do Python.

source: Short (less than 100 lines of code).
pt_br: Curto (menos de 100 linhas de código).

source: Get the Code
pt_br: Obtenha o código

source: :doc:`Free Python Games <index>` is actively developed in a `GitHub repository`_.
pt_br: :doc:`Free Python Games <index>` é desenvolvido ativamente em um `repositório no GitHub`_.

source: You can either clone the public repository::
pt_br: Você pode clonar o repositório público::

source: Download the `tarball <https://github.com/grantjenks/free-python-games/tarball/master>`_::
pt_br: Baixe o `tarball <https://github.com/grantjenks/free-python-games/tarball/master>`_::

source: Or, download the `zipball <https://github.com/grantjenks/free-python-games/zipball/master>`_::
pt_br: Ou, faça o download do `zipball <https://github.com/grantjenks/free-python-games/zipball/master>`_::

source: Installing Dependencies
pt_br: Instalação de dependências

source: Install development dependencies with `pip <http://www.pip-installer.org/>`_::
pt_br: Instale as dependências de desenvolvimento com `pip <http://www.pip-installer.org/>`_::

source: All packages for running tests and building documentation will be installed.
pt_br: Todos os pacotes para a execução de testes e documentação de construção serão instalados.

source: Testing
pt_br: Testando

source: :doc:`Free Python Games <index>` currently tests against three versions of Python:
pt_br: :doc:`Free Python Games <index>` é atualmente testado em três versões do Python:

source: Testing uses `tox <https://pypi.python.org/pypi/tox>`_. If you don't want to install all the development requirements, then, after downloading, you can simply run::
pt_br: Os testes usam `tox <https://pypi.python.org/pypi/tox>`_. Se você não deseja instalar todos os requisitos de desenvolvimento, então, após o download, você pode simplesmente executar::

source: The test argument to setup.py will download a minimal testing infrastructure and run the tests.
pt_br: O argumento de teste para setup.py irá baixar uma infraestrutura mínima de testes e executar os testes.
