Repository: analaura09/free-python-games
Catalog: docs/locale/*/LC_MESSAGES/give-gift-python.po
Languages: pt_br

source: Give the Gift of Python
pt_br: Dê a Dádiva de Python

source: *Talk given at SF Python Holiday Party on December 5, 2018.*
pt_br: *Palestra proferida na SF Python Holiday Party em 5 de dezembro de 2018.*

source: Who am I?
pt_br: Quem eu sou?

source: Python programmer.
pt_br: Programador Python.

source: Hundreds of hours of classroom instruction.
pt_br: Muitas horas de instrução em sala de aula.

source: What we need?
pt_br: O que nós precisamos?

source: Interest!
pt_br: Interesse!

source: Typing skills.
pt_br: Saber digitar.

source: Math: Arithmetic, Algebra, Geometry
pt_br: Matemática: aritmética, álgebra, geometria

source: Setup
pt_br: Configuração

source: Install Python, https://www.python.org/
pt_br: Instale Python, https://www.python.org/

source: Run IDLE, ``$ python -m idlelib.idle``
pt_br: Execute IDLE, ``$ python -m idlelib.idle``

source: Write code.
pt_br: Escreva o código.

source: Open the Turtle Window
pt_br: Abra a janela Turtle

source: Commands
pt_br: Comandos

source: Loops
pt_br: Repetições

source: Shapes
pt_br: Formas

source: Dots
pt_br: Pontos

source: Functions
pt_br: Funções

source: Colors
pt_br: Cores

source: Locations
pt_br: Localizações

source: Inputs
pt_br: Entradas

source: Animation
pt_br: Animação

source: Tips
pt_br: Dicas

source: Embrace copy/paste
pt_br: Abraçar copiar/colar

source: Close window/reset()
pt_br: Fechar aba / reinicializar()

source: Activities
pt_br: Atividades

source: Spell your name.
pt_br: Soletre o seu nome.

source: Notes
pt_br: Notas

source: Start simple! Start easy! Start plain!
pt_br: Comece simples! Comece facilmente! Comece bem!

source: Focus on fun! No PEP8. No Pylint.
pt_br: Concentre-se na diversão! Sem PEP8. Sem Pylint.

source: Make it readable! Say it aloud.
pt_br: Torne-o legível! Diga-o em voz alta.

source: No special shells! No IPython.
pt_br: Sem shells especiais! Sem IPython.

source: Show them mistakes! Red is your favorite color!
pt_br: Mostre-lhes erros! Vermelho é a sua cor favorita!

source: No virtual environments!
pt_br: Sem ambientes virtuais!

source: If they're not ready, don't push them!
pt_br: Se eles não estiverem prontos, não os empurre!

source: No dunder methods or attributes! No __name__ or __main__.
pt_br: Sem métodos ou atributos dunder! Sem __name__ or __main__.
